Younes2015/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.;

vertices
(
    (0 0 0)
    (3 0 0)
    (3 1 0)
    (0 1 0)
    (0 0 1)
    (3 0 1)
    (3 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (400 200 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (3 2 6 7)
        );
    }
    leftside
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    rightside
    {
        type patch;
        faces
        (
            (5 6 2 1)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
